{
    "GoogleEP" : [
        "Created a usage metrics dashboard in Python for testing infrastructure that managed pools of sandbox environments in order to show leadership and clients the impact of the tool.",
        "Utilized technologies such as the Spanner database, protocol buﬀers, and an internal ﬁle compression/storage tool that transformed data into a structure queryable with SQL which allowed metrics to display on the dashboard in the form of various graph types.",
        "Implemented a pipeline in Python to fetch, transform, organize and prepare data metrics from a Spanner database.",
        "Presented documentation and usage metrics dashboard to an extended team of 20 including 3 project managers as well as 45 interns."
    ],
    "CreateFlaskApp" : [
        "Developing a version of Facebook's Create-React-App package that instead creates a ready-to-run template of a Python Flask API utilizing flask-restful.",
        "The project is currently in alpha, but is available to install via PyPi."
    ],
    "DailyPopcorn" : [
        "Worked in a team of 3 to develop a social media platform revolving around movie lovers and critics alike similar to Rottentomatoes.",
        "The project uses the MERN tech stack and was hosted on heroku."
    ],
    "Atawear" : [
        "Worked in a team of 5 to develop a prototype bracelet to monitor heart rate in infants with the ability to report abnormal changes such as heart fibrillation.",
        "Implemented a server in Python using Plotly's Dash framework in order to both communicate with the bracelet prototype as well as display a dashboard UI to view infant heart rate in real time.",
        "The prototype device was an arduino affixed with a heart rate sensor that sent data to the server over wifi."
    ],
    "ToDoIt" : [
        "Developed a full stack application that kept track of future tasks that the user wanted to be reminded of.",
        "Tasks were uploaded with a date and time so that the application could email the user a reminder of that task at the date/time given.",
        "App was developed mainly using Python Flask along with jinja templates and sqlite for database management."
    ],
    "MEC" : [
        "Studied for Bachelor in Computer Science.",
        "Studied for a minor in Mathematics.",
        "Heavily involved in the MEC chapter Association for Computing Machinery (ACM) first as Vice President and then as President, each for one year.",
        "Worked with Faculty during the Covid Pandemic to accomodate students in a virtual setting and ensure they had the resources (laptops, learning environment, etc) they needed to succeed.",
        "Worked as a tutor and as a TA for our fundamental courses in order to ensure students had a solid foundation in CS fundamentals such as OOP, DS&A, and program design."
    ],
    "Contact" : {
        "github" : "https://github.com/ElvisRodriguez",
        "linkedin" : "https://www.linkedin.com/in/elvis-rodriguez-20brklyn20/",
        "pypi" : "https://pypi.org/user/ElvisRodriguez/",
        "email" : "mailto: elvisrodriguez1992@gmail.com"
    }
}